import Image from "next/image";
import Link from "next/link";
import React from "react";
import { FiChevronLeft } from "react-icons/fi";
function Blog() {
  const Maindata = [
    {
      title: "چه گونه دانه کیفیت بالا پیدا کنیم؟",
      summery: "ایپسوم متن ساختگی با تولید سادگی نامفهوم",
      image: "/blog/sample-1.jpg",
      date: "1401/6/12",
      id: 1,
      discription:
        "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد",
    },
    {
      title: "چه گونه دانه کیفیت بالا پیدا کنیم؟",
      image: "/blog/sample-2.jpeg",
      summery: "ایپسوم متن ساختگی با تولید سادگی نامفهوم",
      id: 2,
      date: "1401/6/12",

      discription:
        "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.",
    },
    {
      title: "چه گونه دانه کیفیت بالا پیدا کنیم؟",
      image: "/blog/sample-3.jpg",
      summery: "ایپسوم متن ساختگی با تولید سادگی نامفهوم",
      id: 3,
      date: "1401/6/12",

      discription:
        "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.",
    },
    {
      title: "چه گونه دانه کیفیت بالا پیدا کنیم؟",
      image: "/blog/sample-4.jpg",
      summery: "ایپسوم متن ساختگی با تولید سادگی نامفهوم",
      id: 4,
      date: "1401/6/12",

      discription:
        "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.",
    },
    {
      title: "چه گونه دانه کیفیت بالا پیدا کنیم؟",
      image: "/blog/sample-5.jpg",
      summery: "ایپسوم متن ساختگی با تولید سادگی نامفهوم",
      id: 5,
      date: "1401/6/12",

      discription:
        "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.",
    },
    {
      title: "چه گونه دانه کیفیت بالا پیدا کنیم؟",
      summery: "ایپسوم متن ساختگی با تولید سادگی نامفهوم",
      image: "/blog/sample-1.jpg",
      id: 6,
      date: "1401/6/12",

      discription:
        "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد",
    },
  ];
  const data = Maindata.slice(0, 3);

  return (
    <div className="w-full min-h-screen bg-gray-100 overflow-x-hidden flex flex-col px-10 py-28 items-center justify-start ">
      <div className="text-center">
        <h4 className="text-2xl text-amber-700 font-IransansBold mb-5">
          اخرین بلاگ ها
        </h4>
        <h1 className="text-4xl font-Iransansblack text-neutral-800 mb-6">
          با ما بهترین باشید
        </h1>
      </div>
      <div className="w-full grid md:grid-cols-2 lg:grid-cols-3 gap-5 max-w-[1250px] ">
        {data.map((item, index) => {
          return (
            <div
              data-aos="zoom-out"
              key={index}
              className="group w-full h-full rounded-md duration-300 hover:shadow-lg overflow-hidden bg-gray-50 shadow-md"
            >
              <div className=" h-80 w-full duration-300 overflow-hidden mb-5 relative">
                <Image
                  src={item.image}
                  className="object-cover duration-200 group-hover:scale-110 group-hover:blur-sm "
                  fill
                  alt={item.title}
                />
              </div>
              <div className="px-6 my-3">
                <h3 className="text-xl group-hover:text-amber-600 text-start font-IransansBold mb-3 ">
                  {item.title}
                </h3>
                <p className="text-sm text-gray-500">{item.summery}</p>
                <Link href={`/Blog/${item.id}`}>
                  <button className="px-4 py-2 flex items-center justify-center space-x-2 hover:bg-amber-600 duration-200 bg-amber-700 rounded-md text-gray-50 shadow-sm my-4">
                    ادامه مطلب
                    <FiChevronLeft />
                  </button>
                </Link>
              </div>
            </div>
          );
        })}
      </div>

      <Link
        href={"/Blog"}
        alt="blog"
        scroll={true}
        className=" w-full max-w-[300px]"
      >
        <button className=" px-6 py-2 border border-amber-700 w-full mx-auto rounded mt-10 duration-300 text-amber-700 hover:bg-amber-700 hover:text-neutral-50 hover:drop-shadow-lg ">
          بیشتر...
        </button>
      </Link>
    </div>
  );
}

export default Blog;
