import Image from "next/image";
import Link from "next/link";
import React from "react";

function Page({ params }) {
  const Maindata = [
    {
      title: "چه گونه دانه کیفیت بالا پیدا کنیم؟",
      summery: "ایپسوم متن ساختگی با تولید سادگی نامفهوم",
      image: "/blog/sample-1.jpg",
      date: "1401/6/12",
      id: 1,
      discription:
        "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد",
    },
    {
      title: "چه گونه دانه کیفیت بالا پیدا کنیم؟",
      image: "/blog/sample-2.jpeg",
      summery: "ایپسوم متن ساختگی با تولید سادگی نامفهوم",
      id: 2,
      date: "1401/6/12",

      discription:
        "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.",
    },
    {
      title: "چه گونه دانه کیفیت بالا پیدا کنیم؟",
      image: "/blog/sample-3.jpg",
      summery: "ایپسوم متن ساختگی با تولید سادگی نامفهوم",
      id: 3,
      date: "1401/6/12",

      discription:
        "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.",
    },
    {
      title: "چه گونه دانه کیفیت بالا پیدا کنیم؟",
      image: "/blog/sample-4.jpg",
      summery: "ایپسوم متن ساختگی با تولید سادگی نامفهوم",
      id: 4,
      date: "1401/6/12",

      discription:
        "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.",
    },
    {
      title: "چه گونه دانه کیفیت بالا پیدا کنیم؟",
      image: "/blog/sample-5.jpg",
      summery: "ایپسوم متن ساختگی با تولید سادگی نامفهوم",
      id: 5,
      date: "1401/6/12",

      discription:
        "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.",
    },
    {
      title: "چه گونه دانه کیفیت بالا پیدا کنیم؟",
      summery: "ایپسوم متن ساختگی با تولید سادگی نامفهوم",
      image: "/blog/sample-1.jpg",
      id: 6,
      date: "1401/6/12",

      discription:
        "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد",
    },
  ];
  const aside = Maindata.slice(3, Maindata.length);
  const founded = Maindata.find((item) => {
    return item.id === Number(params.id);
  });

  return (
    <div className="w-full min-h-screen py-16 px-5 md:px-16 bg-gray-50">
      <div className="w-full grid grid-cols-1 lg:grid-cols-3 gap-5">
        <div className="h-full w-full p-2 order-2 lg:order-1">
          <div className="flex flex-col space-y-6  md:sticky md:top-24   w-full">
            <h1 className="font-Iransansblack text-amber-700 text-2xl">
              اخرین بلاگ ها
            </h1>
            {aside.map((item) => {
              return (
                <Link key={item.id} href={`Blog/${item.id}`}>
                  <div className="group cursor-pointer select-none flex items-center justify-center border-b pb-6">
                    <div className="w-28 h-28 rounded-sm overflow-hidden  relative">
                      <Image
                        src={item.image}
                        alt={item.id}
                        fill
                        className="object-cover object-center"
                      />
                    </div>
                    <div className="mr-5">
                      <h5 className="font-IransansBold group-hover:text-amber-700 text-gray-800 text-xl">
                        {item.title}
                      </h5>
                      <p className="text-sm text-gray-500 my-5">
                        {item.summery}
                      </p>
                    </div>
                  </div>
                </Link>
              );
            })}
          </div>
        </div>
        <div className="w-full flex flex-col  min-h-screen lg:col-span-2 order-1 lg:order-2">
          <div className="w-full h-72  relative">
            <Image
              src={founded.image}
              alt={founded.id}
              fill
              className="object-cover object-center  "
            />
          </div>
          <div className=" my-6 flex justify-between items-center px-6">
            <h1 className="md:text-4xl text-2xl  font-IransansBold text-gray-800">
              {founded.title}
            </h1>
            <p className="text-gray-500">{founded.date}</p>
          </div>
          <div className="px-6 my-4 text-center">
            <p className=" text-gray-700">{founded.discription}</p>
          </div>
        </div>
      </div>
    </div>
  );
}

export default Page;
